Autodesk.Revit.DB.SunAndShadowSettings.GetActiveSunAndShadowSettings(Autodesk.Revit.DB.Document)
Returns the current SunAndShadowSettings element assigned to the active view for the
supplied document.
aDocument:
The document.
Returns:
The active SunAndShadowSettings element for the supplied document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.FitToModel
Adjust SunAndShadowSettings to fit around the current model geometry.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The SunAndShadowSettings is not view-specific.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.CalculateTimeZone(System.Double,System.Double)
Use Revit's utilities to calculate the time zone for a given longitude and latitude.
Remarks:
For some latitude and longitude boundary cases, the time zone calculated may not be correct.
The API offers the ability to adjust the time zone independent of Revit's calculations for situations
where this happens.
latitude:
The latitude.
longitude:
The longitude.
Returns:
The time zone, in hours, ranging from +12 hours to -12 hours with 0 being GMT.
Since:
2012

Autodesk.Revit.DB.SunAndShadowSettings.IsTimeIntervalValid(Autodesk.Revit.DB.SunStudyTimeInterval)
Checks whether the time interval is valid for the SunAndShadowType.
interval:
Time interval value.
Returns:
True if the time interval is valid for the current SunAndShadowType, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.IsGroundPlaneLevelValid(Autodesk.Revit.DB.ElementId)
Checks whether the element represents a valid Ground Plane level.
levelId:
Level element id.
Returns:
True if the element is a valid Ground Plane Level, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.IsFrameValid(System.Double)
Checks whether the frame is valid for the supplied SunAndShadowSettings.
frame:
Frame value
Returns:
True if the frame is valid for the SunAndShadowSettings, false otherwise.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.IsBeforeEndDateAndTime(System.DateTime)
Checks whether the start date and time is valid.
time:
Date and time value
Returns:
True if the date and time is valid, false otherwise.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.IsAfterStartDateAndTime(System.DateTime)
Checks whether the end date and time is valid.
time:
Date and time value
Returns:
True if the date and time is valid, false otherwise.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.GetSunset(System.DateTime)
Identifies the sunset time for the SunAndShadowSettings element at its current location
and indicated date.
Remarks:
The value returned is affected by the value of the Autodesk.Revit.DB.SunAndShadowSettings.UsesDST
flag set for the current location.  If this value is true, the sunset value will be adjusted for
Daylight Savings Time, regardless of the value of the input date.
date:
The date for which to determine sunset time.
Returns:
The date and time.  The value will be in Coordinated Universal Time (UTC).
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.GetSunrise(System.DateTime)
Identifies the sunrise time for the SunAndShadowSettings element at its current location
and indicated date.
Remarks:
The value returned is affected by the value of the Autodesk.Revit.DB.SunAndShadowSettings.UsesDST
flag set for the current location.  If this value is true, the sunrise value will be adjusted for
Daylight Savings Time, regardless of the value of the input date.
date:
The date for which to determine sunrise time.
Returns:
The date and time.  The value will be in Coordinated Universal Time (UTC).
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.GetFrameAzimuth(System.Double)
Identifies the azimuth of the sun (angle in radians) for a specific frame.
frame:
Frame for which time is requested
Returns:
Azimuth angle (radians).  This is measured counterclockwise from the X axis (East direction).  Note that this
is a different frame of reference than is used by Revit for the Lighting Study Azimuth value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the frame value frame is not valid.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.GetFrameAltitude(System.Double)
Identifies the altitude of the sun (angle in radians) for a specific frame.
frame:
Frame for which time is requested
Returns:
Altitude angle (radians)
Throws Autodesk.Revit.Exceptions.ArgumentException:
the frame value frame is not valid.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.GetFrameTime(System.Double)
Identifies the date and time of the SunAndShadowSettings element for a given frame.
frame:
Frame for which time is requested
Returns:
The date and time.  The value will be in Coordinated Universal Time (UTC).
Throws Autodesk.Revit.Exceptions.ArgumentException:
the frame value frame is not valid.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.GetMatchingPreset
Finds the name of the 'per-document' SunAndShadowSettings that matches the properties
of this per-view element.
Returns:
Name of the per-document SunAndShadowSettings that matches the view specific element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The SunAndShadowSettings is not view-specific.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.SharesSettings
Identifies whether settings are shared globally.
Remarks:
Identifies whether the per-view SunAndShadowSettings element shares global settings.
Global settings are a special case that allows multiple views to be associated together
in order that a change in one view affects that same change in other views. There cannot be
multiple such groups, and a SunAndShadowSettings element is either a global setting or not.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.ProjectLocationId
Identifies the ProjectLocation element used by the SunAndShadowSettings element.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.ProjectLocationName
Identifies the name of the project location used by the SunAndShadowSettings element.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.UsesDST
Identifies whether the SunAndShadowSettings element is using daylight savings time.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.TimeZone
Identifies the time zone.
Remarks:
Identifies the time zone used by the SunAndShadowSettings element.
This property indicates the time zone in which the site resides.
The value is in hours, ranging from +12 hours to -12 hours with 0 being GMT.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.Longitude
Identifies the current longitude used by the SunAndShadowSettings element.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.Latitude
Identifies the current latitude used by the SunAndShadowSettings element.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.GroundPlaneHeight
Identifies the ground plane height.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.TimeInterval
Identifies the time interval between animation frames.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the time interval value interval is not valid for the current SunAndShadowType.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.RelativeToView
Identifies whether the SunAndShadowSettings element is relative to the view
direction. This is only relevant for lighting mode.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.UsesGroundPlane
Identifies whether the SunAndShadowSettings element uses a ground plane.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.SunriseToSunset
Identifies whether the current single day sun study is set to run from
sunrise to sunset.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.GroundPlaneLevelId
Identifies the element id of the Ground Plane level for the SunAndShadowSettings element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the element level is not a valid Ground Plane Level element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.NumberOfFrames
Identifies the total number of animation frames for a single-day or multi-day study.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.ActiveFrame
Identifies the active animation frame for a single-day or multi-day study,
starting at 1.0 for the first frame and incrementing in intervals of 1.0.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: the frame value frame is not valid.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.EndDateAndTime
Identifies the end date and time.
Remarks:
This property represents the end time for a single-day or multi-day study.
The end date and time can be set for any study type, but is not always used.
Note that Revit may ignore this value if the SunriseToSunset flag is set.
The date and time.  The output value will be in Coordinated Universal Time (UTC), but input may be
in local time as well.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Revit does not accept input DateTime objects if they are of kind DateTypeKind.Unspecified.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.StartDateAndTime
Identifies the start or current date and time.
Remarks:
This property represents the start time for a single-day or multi-day study, or the current time
for a still sun study. Note that Revit may ignore this value if the SunriseToSunset flag is set.
The date and time.  The output value will be in Coordinated Universal Time (UTC), but input may be
in local time as well.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Revit does not accept input DateTime objects if they are of kind DateTypeKind.Unspecified.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.ActiveFrameTime
Identifies the date and time of the SunAndShadowSettings element for the active frame.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.SunAndShadowType
Identifies the type of the SunAndShadowSettings element.
Remarks:
There are no restrictions on setting the type, but do note that some
properties are not relevant for certain types. For example, the property
EndDateAndTime is not relevant for the type SunAndShadowType.StillImage.
In this example (and elsewhere), the previous value for the property
is remembered for when the type is reverted. If that property has not been
set yet, default values will apply.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.Altitude
Altitude setting (angle in radians). This is only relevant when dealing with a SunAndShadowSettings
element that uses lighting mode.
Altitude angle (radians)
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.Azimuth
Azimuth setting (angle in radians). This is only relevant when dealing with a SunAndShadowSettings
element that uses lighting mode.
Azimuth angle (radians)
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings.Visible
Visibility in current view for a per-view SunAndShadowSettings element.
Visibility
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element is not view specific (in which case visibility
is not relevant) or if internally its view is not accessible.
Since:
2011

Autodesk.Revit.DB.SunAndShadowSettings
The SunAndShadowSettings class represents the sun control.
Remarks:
The SunAndShadowSettings element represents the settings applied to a project or view regarding
the position, dates, time intervals and other options for the sun control and solar studies.
To differentiate between the project and view settings, test the ViewSpecific or OwnerViewId property.
If the element is not view-specific this element represents a project-wide setting.
If the element is associated to a view, this element represents a per view SunAndShadowSettings.
When you create a new view, a new view-specific SunAndShadowSettings element is automatically created
for it.
Since:
2011